In [1]:
import pandas as pd
import pandas_datareader as pdr
import numpy as np
import dbf
from simpledbf import Dbf5

PyTables is not installed. No support for HDF output.
SQLalchemy is not installed. No support for SQL output.

In [4]:
mar_14 = Dbf5('../data/data mariages 2014.dbf').to_dataframe()

mar_15 = Dbf5('../data/data mariages 2015.dbf').to_dataframe()

mar_16  = Dbf5('../data/data mariages 2016.dbf').to_dataframe()

mar_17 = Dbf5('../data/data mariages 2017.dbf').to_dataframe()

mar_18 = Dbf5('../data/data mariages 2018.dbf').to_dataframe()

mar_19 = Dbf5('../data/data mariages 2019.dbf').to_dataframe()

mar_20 = Dbf5('../data/data mariages 2020.dbf').to_dataframe()

In [5]:
def filter_df(df):
    df.drop(columns = ['ANAIS1', 'DEPNAIS1', 'INDNAT1', 'ETAMAT1', 'ANAIS2', 'DEPNAIS2', 'INDNAT2','ETAMAT2', 'JSEMAINE', 'DEPDOM', 'TUDOM', 'TUCOM', 'NBENFCOM'], axis=1, inplace=True)

In [6]:
filter_df(mar_14)
filter_df(mar_15)
filter_df(mar_16)
filter_df(mar_17)
filter_df(mar_18)
filter_df(mar_19)
filter_df(mar_20)

In [7]:
df = pd.concat([mar_14, mar_15, mar_16, mar_17, mar_18, mar_19, mar_20])

In [8]:
df

       SEXE1 SEXE2  AMAR MMAR DEPMAR
0          F     M  2014   02     01
1          M     F  2014   08     01
2          M     F  2014   08     01
3          M     F  2014   08     01
4          M     F  2014   05     01
...      ...   ...   ...  ...    ...
154576     M     F  2020   02     64
154577     M     F  2020   07     83
154578     M     F  2020   05     29
154579     M     F  2020   09    974
154580     M     F  2020   01     95

[1555919 rows x 5 columns]

In [101]:
janv = df[df['MMAR'] == '01']
graph = pd.DataFrame(janv.groupby(['AMAR', 'DEPMAR']).size(), columns = ['jan'])

L = ['janv', 'fev', 'mars', 'avril', 'mai', 'juin', 'juillet', 'aout', 'sept', 'oct','nov','dec']
cpt = 1
month_list = df.groupby('MMAR').size().index.tolist()
month_list.pop(0)

for idx in month_list:
    col = df[df['MMAR'] == idx]
    graph.insert(cpt, L[cpt],col.groupby(['AMAR', 'DEPMAR']).size())
    cpt += 1

In [102]:
graph

             jan  fev  mars  avril    mai  juin  juillet  aout  sept  oct  \
AMAR DEPMAR
2017 01       44   70  59.0  179.0  209.0   326      371   264   327  133
     02       41   48  71.0  145.0  149.0   283      380   266   268   92
     03       23   26  21.0   77.0   79.0   152      236   178   154   37
     04       14   11  18.0   46.0   60.0   103      145    89   100   40
     05       16   11  10.0   37.0   38.0    93       91    71    68   25
...          ...  ...   ...    ...    ...   ...      ...   ...   ...  ...
2020 971      54   71  20.0    NaN    2.0    19       79   141    33   75
     972      48   62  18.0    2.0    NaN    22       88   140    42   63
     973      24   46  12.0    NaN    NaN    13       20    41    28   51
     974     112  163  52.0    3.0    3.0    75      217   267   186  336
     976      43   44  17.0    NaN    NaN     5        4    27    27   31

             nov  dec
AMAR DEPMAR
2017 01       73  109
     02       44   73
     03       31   36
     04       20   21
     05       14   23
...          ...  ...
2020 971      36  227
     972      36  227
     973      35   80
     974      98  409
     976      33   29

[709 rows x 12 columns]